/*
    Author: Margaritis Stathis

    Περιγραφή:

        Αρχείο που περιέχει συναρτήσεις υπολογισμού του νόμου της πυκνότητας.
        Οι συναρτήσεις αυτές θα χρησιμοποιηθούν στην κατασκευή ενός υπολογιστή τιμών
        σε μορφή ιστοσελίδας όπου ο χρήστης μπορεί να εισαγάγει τιμές σε πεδία εισόδου
        και να υπολογίζει το νόμο της πυκνότητας ανάλογα με τις γνωστές παραμέτρους που έχει στη διάθεσή του κάθε φορά.
*/
// συνάρτηση υπολογισμού της πυκνότητας με γνωστά τη μάζα και τον όγκο
function Density_D(m,V,units) {
    // δήλωσε μία μεταβλητή που θα κρατά την πυκνότητα και αρχικοποίησέ τη σε 0
    let D = 0;
    // στην περίπτωση που η παράμετρος V δεν είναι 0 τότε
    if (V != 0)
        D = m/V;    // υπολόγισε την τιμή της πυκνότητας

    // Αν πρέπει να εμφανίσουμε μονάδες μέτρησης στο αποτέλεσμα
    if (units == true)
        D = D + " kg/m^3";   // μορφοποίησε το αποτέλεσμα σε μορφή συμβολοσειράς με μονάδα μέτρησης

    return D;       // επέστρεψε την τιμή της πυκνότητας
}        
// συνάρτηση υπολογισμού της μάζας με γνωστά την πυκνότητα και τον όγκο
function Density_m(D,V,units) {

    // δήλωσε μια μεταβλητή που θα κρατά το αποτέλεσμα
    let m = D * V;   // υπολόγισε την τιμή της μάζας

    // Αν πρέπει να εμφανίσουμε μονάδες μέτρησης στο αποτέλεσμα 
    if (units == true)
        m = m + " kg"; // μορφοποίησε το αποτέλεσμα σε μορφή συμβολοσειράς με μονάδα μέτρησης

    return m;    // επέστρεψε την τιμή της μάζας
}
// συνάρτηση υπολογισμού του όγκου με γνωστά την πυκνότητα και τη μάζα
function Density_V(D,m,units) {
    // δήλωσε μία μεταβλητή που θα κρατά την τιμή του όγκου
    let V = 0;
    // άν η παράμετρος D δέν έχει την τιμή 0
    if (D != 0)
        V = m/D;  // υπολόγισε τον όγκο απο τις παραμέτρους

    // Αν πρέπει να εμφανίσουμε μονάδες μέτρησης στο αποτέλεσμα 
    if (units == true)
        V = V + " m^3"; // μορφοποίησε το αποτέλεσμα σε μορφή συμβολοσειράς με μονάδα μέτρησης
    
    return V;  // επέστρεψε την τιμή του όγκου
}